Autodesk.Revit.DB.DimensionType.CanHaveOrdinateDimensionSetting
Checks whether this dimension style can have an ordinate dimension setting.
Remarks:
It returns true when the DimensionType is ordinate.
Returns:
True when the DimensionType is ordinate, false otherwise.

Autodesk.Revit.DB.DimensionType.SetOrdinateDimensionSetting(Autodesk.Revit.DB.OrdinateDimensionSetting)
Sets ordinate dimension setting
Throws Autodesk.Revit.Exceptions.ArgumentException:
The origin tick mark id in the Ordinate Dimension Setting is invalid for the dimension style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.GetOrdinateDimensionSetting
Gets ordinate dimension setting
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.CanHaveEqualityFormula
Checks whether this dimension style can have an equality formular.
Remarks:
It returns true when the DimensionType is continuous linear or angular.
Returns:
True when the DimensionType is continuous linear or angular, false otherwise.

Autodesk.Revit.DB.DimensionType.SetEqualityFormula(System.Collections.Generic.IList{Autodesk.Revit.DB.DimensionEqualityLabelFormatting})
Sets dimension equality formats
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.GetEqualityFormula
Gets dimension equality formats
Returns:
A list of DimensionEqualityLabelFormatting objects
Since:
2017 Subscription Update